[
  {
    "_id":"64270080071daa79c2894ee1",
    "name":"Archena Thermal Complex",
    "address":"Carretera del Balneario, s/n, 30600 Archena, Murcia, Spain",
    "country":"Spain",
    "state":"Murcia",
    "city":"Archena",
    "lat":"38.121161",
    "long":"-1.306359",
    "temperatureMin":30,
    "temperatureMax":41,
    "type":"Mineral-medicinal",
    "public":true,
    "hotel":true,
    "description":"The Archena Thermal Complex is a modern facility that combines traditional hydrotherapy treatments with the latest technology. It has a wide range of thermal pools, saunas, and relaxation areas, as well as a variety of treatments for wellness and beauty. The water is of volcanic origin and has therapeutic properties for skin, respiratory, and rheumatic problems.",
    "setting":"The Archena Thermal Complex is situated in a picturesque valley surrounded by mountains and natural parks. The complex is set in a lush garden with palm trees, flowers, and waterfalls, creating a relaxing and peaceful environment for visitors to enjoy.",
    "createdAt":"2023-04-01T03:37:27.288Z",
    "updatedAt":"2023-04-01T03:37:27.288Z"
  },
  {
    "_id":"642700ba071daa79c2894ee3",
    "name":"Caldaria Termal Hotel",
    "address":"Rua do Balneario, s/n, 32417 Laias, Ourense, Spain",
    "country":"Spain",
    "state":"Galicia",
    "city":"Laias",
    "lat":"42.330554",
    "long":"-8.028677",
    "temperatureMin":36,
    "temperatureMax":43,
    "type":"Mineral-medicinal",
    "public":true,
    "hotel":true,
    "description":"The Caldaria Termal Hotel is a luxurious thermal spa resort that offers a wide range of thermal treatments, as well as wellness and beauty services. The water is of volcanic origin and has therapeutic properties for skin, respiratory, and rheumatic problems.",
    "setting":"The Caldaria Termal Hotel is located in a rural area surrounded by forests and vineyards, providing a peaceful and tranquil environment for visitors to relax and unwind.",
    "createdAt":"2023-04-01T03:37:27.288Z",
    "updatedAt":"2023-04-01T03:37:27.288Z"
  },
  {
    "_id":"642700f5071daa79c2894ee5",
    "name":"Elgorriaga Thermal Spa",
    "address":"Barrio Elizatea, s/n, 31744 Elgorriaga, Navarre, Spain",
    "country":"Spain",
    "state":"Navarre",
    "city":"Elgorriaga",
    "lat":"43.246881",
    "long":"-1.604689",
    "temperatureMin":34,
    "temperatureMax":39,
    "type":"Mineral-medicinal",
    "public":true,
    "hotel":true,
    "description":"The Elgorriaga Thermal Spa is a historic thermal complex that dates back to the 19th century. It offers a range of thermal pools, saunas, and relaxation areas, as well as a variety of treatments for wellness and beauty. The water is of volcanic origin and has therapeutic properties for skin, respiratory, and rheumatic problems.",
    "setting":"The Elgorriaga Thermal Spa is located in a quiet village surrounded by mountains and natural parks, providing a peaceful and relaxing environment for visitors to enjoy.",
    "createdAt":"2023-04-01T03:37:27.288Z",
    "updatedAt":"2023-04-01T03:37:27.288Z"
  },
  {
    "_id":"6427011c071daa79c2894ee7",
    "name":"Lanjarón Spa",
    "address":"Calle el Salado, 29640 Lanjarón, Granada, Spain",
    "country":"Spain",
    "state":"Andalusia",
    "city":"Lanjarón",
    "lat":"36.920326",
    "long":"-3.488683",
    "temperatureMin":32,
    "temperatureMax":38,
    "type":"Mineral-medicinal",
    "public":true,
    "hotel":true,
    "description":"The Lanjarón Spa is a historic spa complex that has been operating since the 18th century. It offers a variety of thermal pools, saunas, and relaxation areas, as well as a range of treatments for wellness and beauty. The water is of volcanic origin and has therapeutic properties for skin, respiratory, and rheumatic problems.",
    "setting":"The Lanjarón Spa is situated in a beautiful mountainous region in Andalusia, surrounded by natural parks and breathtaking landscapes. The spa's facilities are set in a lush garden with fountains and palm trees, providing a tranquil and relaxing environment for visitors to enjoy.",
    "createdAt":"2023-04-01T03:37:27.289Z",
    "updatedAt":"2023-04-01T03:37:27.289Z"
  },
  {
    "_id":"64270156071daa79c2894ee9",
    "name":"Riofrio Thermal Spa",
    "address":"Carretera Alhama, Km 7, 18198 Riofrio, Granada, Spain",
    "country":"Spain",
    "state":"Andalusia",
    "city":"Riofrio",
    "lat":"37.036647",
    "long":"-3.951601",
    "temperatureMin":34,
    "temperatureMax":42,
    "type":"Mineral-medicinal",
    "public":true,
    "hotel":true,
    "description":"The Riofrio Thermal Spa is a modern thermal complex that offers a wide range of thermal pools, saunas, and relaxation areas, as well as a variety of treatments for wellness and beauty. The water is of volcanic origin and has therapeutic properties for skin, respiratory, and rheumatic problems.",
    "setting":"The Riofrio Thermal Spa is located in a tranquil and peaceful area of Andalusia, surrounded by mountains and natural parks. The complex is set in a lush garden with palm trees, flowers, and waterfalls, creating a relaxing and soothing environment for visitors to enjoy.",
    "createdAt":"2023-04-01T03:37:27.289Z",
    "updatedAt":"2023-04-01T03:37:27.289Z"
    }
  ]
